
### Terragrunt diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]
azurerm_public_ip.ip-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-dev-box]
azurerm_public_ip.ip-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_private_dns_zone.phz: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/privateDnsZones/servrfarm.tech]
azurerm_managed_disk.dev-box-storage: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/disks/dev-box-storage]
azurerm_virtual_network.vnet-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev]
azurerm_nat_gateway.ng-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev]
azurerm_ssh_public_key.ssh-pub-key: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/sshPublicKeys/global-ssh-key]
azurerm_network_security_group.nsg-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box]
azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_subnet.subnet-pub-dev-01: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_security_rule.nsg-dev-box-allow-ssh: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInboundSSH]
azurerm_network_security_rule.ngs-dev-box-allow-443: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInbound443]
azurerm_network_security_rule.ngs-dev-box-allow-80: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInbound80]
azurerm_subnet_network_security_group_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_subnet_nat_gateway_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_interface.nif-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-dev-box]
azurerm_network_interface_security_group_association.assoc-nif-sg-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-dev-box|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.dev-box will be created
  + resource "azurerm_linux_virtual_machine" "dev-box" {
      + admin_username                                         = "farmer"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "centralindia"
      + max_bid_price                                          = -1
      + name                                                   = "dev-box.servrfarm.tech"
      + network_interface_ids                                  = [
          + "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-dev-box",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "dev-rg"
      + size                                                   = "Standard_D2as_v5"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDx03S3hclm8TvkSDGkKUt5zh28vUXDKJVRcN5pIkOyRuAw6CeihNt3iaNBx0QpSg9PU3IMK6qx5cEPAIT2lbbaPFsXEs7clzLfn1nyrtZlKt2B+0ntVYMS/LiR17QW+CkVmXnuV5PPODesTvswrziRYriRsQCRvMup3Foem0ym6ZLUb5KFYECWuC+Vh2iZqlj2PmpoqmgDcDVnBqyAyURPgqQCKzlnsRLtGAf/6/pVvgLrZhHcVLMvkrkzPHzK344S5XM1fCweGgXyjD+t1EBRe1BpK1aOYYKKXJ3I3z5Mbm2T+m/ttSpCYaX+vfjNH1bh/+r7+9+/vVNJ5YT9j9UgXU1PAfVA5Hft+64u78iAAMdRIR6KRFzAaB/IX1avVhbdN3d8DB731Hc1xXESiGUUVD6S1AoN8x0sJwG8QVLmVmmx5N+7wbD9VgXwMUJJgqPatJADbUVpyZpAFZje1S40ywOBesA+6xblmmFT30MIjnVQFdZex7YJJI6EepZBl20= warri@EchelonVI-W11"
          + username   = "farmer"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 32
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_virtual_machine_data_disk_attachment.attach-dev-box-storage-to-dev-box will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "attach-dev-box-storage-to-dev-box" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 10
      + managed_disk_id           = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/disks/dev-box-storage"
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
